# Descriptive statistics

## Setup

In [1]:
import pandas as pd

## Creation

Creation of an example DataFrame (starting from a dictionary of dictionaries):

In [2]:
data = {
    "Capital": {
        "Spain": "Madrid",
        "Belgium": "Brussels",
        "France": "Paris",
        "Italy": "Roma",
        "Germany": "Berlin",
        "Portugal": "Lisbon",
        "Norway": "Oslo",
        "Greece": "Athens",
    },
    "Population": {
        "Spain": 46733038,
        "Belgium": 11449656,
        "France": 67076000,
        "Italy": 60390560,
        "Germany": 83122889,
        "Portugal": 10295909,
        "Norway": 5391369,
        "Greece": 10718565,
    },
    "Monarch": {
        "Spain": "Felipe VI",
        "Belgium": "Philippe",
        "Norway": "Harald V",
    },
    "Area": {
        "Spain": 505990,
        "Belgium": 30688,
        "France": 640679,
        "Italy": 301340,
        "Germany": 357022,
        "Portugal": 92212,
        "Norway": None,
        "Greece": 131957,
    },
}

In [3]:
# For now, let's forget about these steps:
df = pd.DataFrame(data)
df["Capital"] = df["Capital"].astype("string")
df["Monarch"] = df["Monarch"].astype("string")
df["Area"] = df["Area"].astype("Int64")

Apple stock data, taken from the [`matplotlib` sample datasets](https://github.com/matplotlib/sample_data/blob/master/aapl.csv)

In [4]:
# For now, let's forget about these steps:
apple = pd.read_csv("AAPL.csv")
apple["Date"] = apple["Date"].astype("datetime64[ns]")
apple = apple.set_index("Date")
apple = apple.sort_index()

## Demo 1: Descriptive statistics

In [5]:
df

           Capital  Population    Monarch    Area
Spain       Madrid    46733038  Felipe VI  505990
Belgium   Brussels    11449656   Philippe   30688
France       Paris    67076000       <NA>  640679
Italy         Roma    60390560       <NA>  301340
Germany     Berlin    83122889       <NA>  357022
Portugal    Lisbon    10295909       <NA>   92212
Norway        Oslo     5391369   Harald V    <NA>
Greece      Athens    10718565       <NA>  131957

Get the sum of a column:

In [6]:
df["Population"].sum()

295177986

Get the mean of a column:

In [7]:
df["Population"].mean()

36897248.25

Get the minimum value of a column:

In [8]:
df["Area"].min()

30688

Get the maximum value of a column:

In [9]:
df["Area"].max()

640679

Calculate the sum of all columns:

In [10]:
df.isnull()

          Capital  Population  Monarch   Area
Spain       False       False    False  False
Belgium     False       False    False  False
France      False       False     True  False
Italy       False       False     True  False
Germany     False       False     True  False
Portugal    False       False     True  False
Norway      False       False    False   True
Greece      False       False     True  False

In [11]:
df.isnull().sum()

Capital       0
Population    0
Monarch       5
Area          1
dtype: int64

Calculate the sum of all rows:

In [12]:
df.isnull().sum(axis="columns")

Spain       0
Belgium     0
France      1
Italy       1
Germany     1
Portugal    1
Norway      1
Greece      1
dtype: int64

Calculate the sum over both dimensions:

In [13]:
df.isnull().sum().sum()

6

Get descriptive statistics about numerical columns:

In [14]:
df.describe()

         Population           Area
count  8.000000e+00       7.000000
mean   3.689725e+07  294269.714286
std    3.100553e+07  225632.728175
min    5.391369e+06   30688.000000
25%    1.061290e+07  112084.500000
50%    2.909135e+07  301340.000000
75%    6.206192e+07  431506.000000
max    8.312289e+07  640679.000000

## Exercise 1

In [15]:
apple.head()

             Open   High    Low  Close   Volume  Adj Close
Date
1984-09-07  26.50  26.87  26.25  26.50  2981600       3.02
1984-09-10  26.50  26.62  25.87  26.37  2346400       3.01
1984-09-11  26.62  27.37  26.62  26.87  5444000       3.07
1984-09-12  26.87  27.00  26.12  26.12  4773600       2.98
1984-09-13  27.50  27.62  27.50  27.50  7429600       3.14

Get the sum of the "Volume" column:

In [16]:
apple.Volume.sum()

82944013400

Get the mean of the "Open" column:

In [17]:
apple.Open.mean()

46.82351093570125

Get the median of the "Close" column:

In [18]:
apple.Close.median()

38.13

Get the minimum value of the "Low" column:

In [19]:
apple.Low.min()

12.72

Get the maximum value of the "High" column:

In [20]:
apple.High.max()

202.96

Calculate the number of null values in the entire DataFrame:

In [21]:
apple.isnull().sum().sum()

0

Get descriptive statistics about numerical columns:

In [22]:
apple.describe()

,Open,High,Low,Close,Volume,Adj Close
count,6081.000000,6081.000000,6081.000000,6081.000000,6.081000e+03,6081.000000
mean,46.823511,47.681506,45.913595,46.798619,1.363986e+07,23.529794
std,33.993517,34.578077,33.273106,33.947235,1.352107e+07,37.375601
min,12.880000,13.190000,12.720000,12.940000,8.880000e+04,1.650000
25%,24.730000,25.010000,24.200000,24.690000,5.530000e+06,7.380000
50%,38.250000,38.880000,37.460000,38.130000,8.976400e+06,9.910000
75%,53.500000,54.550000,52.500000,53.610000,1.631920e+07,14.360000
max,200.590000,202.960000,197.800000,199.830000,2.650690e+08,199.830000